diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание 
	                                И Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") = Неопределено Тогда
		Элемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
		Элемент.Заголовок = "Действует с (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Элемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
		Элемент.Заголовок = "Действует по (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Элемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		Элемент.Заголовок = "Сумма абонентской платы (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
		Элемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		Элемент.Заголовок = "Стоимость часа работы (добавленный объект)";
		Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание 
							   И Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора") <> Неопределено Тогда
							   	
		Элементы.Удалить(Элементы.Найти("ВКМ_ДатаНачалаДействияДоговора"));					   	
		Элементы.Удалить(Элементы.Найти("ВКМ_ДатаОкончанияДействияДоговора"));	
		Элементы.Удалить(Элементы.Найти("ВКМ_СуммаАбонентскойПлаты"));	
		Элементы.Удалить(Элементы.Найти("ВКМ_СтоимостьЧасаРаботы"));	
//			
//		РеквизитыФормы = ПолучитьРеквизиты();						   
//		УдаляемыеРеквизиты = Новый Массив;
//		Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
//			ИмяРеквизита = РеквизитФормы.Имя;
//			Если СтрНайти(ИмяРеквизита, "ВКМ_") Тогда
//				УдаляемыеРеквизиты.Добавить(ИмяРеквизита);
//			КонецЕсли;
//		КонецЦикла;
//		ИзменитьРеквизиты(, УдаляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
